[
    {
        "level": "meta-data-id",
        "title": "id",
        "content-type": "rawtext",
        "content": "bmode_us"
    },
    {
        "level": "meta-data-parents",
        "title": "parents",
        "content-type": "list_of_strings",
        "content": [
            "US"
        ]
    },
    {
        "level": "meta-data-title",
        "title": "title",
        "content-type": "rawtext",
        "content": "B-mode (2D Ultrasound)"
    },
    {
        "level": "meta-data-acronyms",
        "title": "acronyms",
        "content-type": "list_of_strings",
        "content": [
            "B-mode",
            "",
            "",
            ""
        ]
    },
    {
        "level": "meta-data-shortDescription",
        "title": "shortDescription",
        "content-type": "rawtext",
        "content": "Brightness Mode Ultrasound, or B-Mode Ultrasound (2D Ultrasound), is a widely used medical imaging technique that produces two-dimensional images of internal structures using high-frequency sound waves"
    },
    {
        "level": "1",
        "title": "Modality Name",
        "content-type": "markdown",
        "content": "Brightness Mode Ultrasound (2D Ultrasound)"
    },
    {
        "level": "2",
        "title": "Acronym",
        "content-type": "markdown",
        "content": "B-mode"
    },
    {
        "level": "3",
        "title": "Imaging Principle",
        "content-type": "markdown",
        "content": "the image is generated by varying the brightness of the display based on the strength of the echoed sound waves reflected back from tissues"
    },
    {
        "level": "4",
        "title": "Data Type & File Format",
        "content-type": "markdown",
        "content": "DICOM (.dcm), JPEG (.jpg, .jpeg), PNG (.png), TIFF (.tif, .tiff), BMP (.bmp), AVI (.avi)"
    },
    {
        "level": "4.1",
        "title": "Primary File Format(s)",
        "content-type": "markdown",
        "content": "DICOM (.dcm)"
    },
    {
        "level": "4.2",
        "title": "Data Type",
        "content-type": "markdown",
        "content": "2-dimensional grayscale"
    },
    {
        "level": "4.3",
        "title": "Related Data Types (parent type)",
        "content-type": "markdown",
        "content": "Ultrasound"
    },
    {
        "level": "4.4",
        "title": "Standard Storage Format (which one in 4.1)",
        "content-type": "markdown",
        "content": "DICOM (.dcm)"
    },
    {
        "level": "4.5",
        "title": "Conversion Solutions + Reference",
        "content-type": "table",
        "content": [
            [
                "conversion_from",
                "conversion_to",
                "description",
                "link to code/software"
            ],
            [
                "JPEG (.jpg, .jpeg)",
                "DICOM (.dcm)",
                "***This solution demonstrates how to convert an image (such as PNG or BMP) into a DICOM file using Python, specifically for use in medical imaging applications. The steps involved are as follows:  Tools Used: pydicom: Used to create a DICOM dataset and handle DICOM metadata. Pillow (PIL): Used to load and process the image, handling different formats and converting them to appropriate modes. numpy: Used to manipulate the image data (e.g., converting to a suitable format for DICOM storage). uuid: Generates a unique identifier for the output DICOM file. Process: Load the Image: The image is loaded using Pillow (Image.open()), and basic file information (e.g., format, size) is printed. Convert Image Formats: If the image is in PNG or BMP format, it is converted to RGB mode to standardize pixel depth. Prepare Pixel Data: The image is processed based on its mode (L, RGB, RGBA), and the pixel data is converted to a NumPy array suitable for inclusion in a DICOM file.  ***Explanation of the Solution: Converting JPEG to DICOM in Java This Java program converts a JPEG image to a DICOM file and then updates the DICOM metadata (DICOM header) to include patient information. It uses Dcm4che, a Java-based open-source DICOM toolkit.  Tools Used: Java I/O Libraries (java.io) – Used for reading and writing files. Dcm4che (org.dcm4che2) – A DICOM library for handling, modifying, and writing DICOM files. FileInputStream & FileOutputStream – Used for reading and writing image data. DicomInputStream & DicomOutputStream (Dcm4che) – Used for reading and writing DICOM file structures. DicomObject (Dcm4che) – A DICOM object representation to store metadata. BufferedOutputStream – Improves efficiency in file writing. Process Breakdown: 1. Convert JPEG to DICOM The program loads a JPEG image (AA.jpg) and converts it to DICOM (AA.dcm). The Jpg2Dcm class handles the conversion without adding metadata. 2. Anonymizing and Adding DICOM Metadata The function anonymizeDicom() updates metadata fields such as: Patient ID Patient Name Study ID This is done using the replaceTag() function, which modifies specific DICOM tags. 3. Writing the Modified DICOM File After updating metadata, the function writeDicomFile() saves the modified DICOM file as AA_FINAL.dcm. 4. Batch Processing (Directory Scanning) The getFile() function scans a directory recursively and processes multiple JPEG images, converting and updating their DICOM headers.",
                "https://github.com/jwitos/JPG-to-DICOM/blob/master/jpeg-to-dicom.py , https://stackoverflow.com/questions/21087778/how-to-convert-jpg-image-to-dicom-file-using-dcm4che-3-2-1?rq=3"
            ],
            [
                "PNG (.png)",
                "DICOM (.dcm)",
                "This solution demonstrates how to replace the pixel data in an existing DICOM file with pixel data from a PNG image, creating a new DICOM file with updated image content.  Tools Used: Pillow (PIL):  Description: A Python Imaging Library used for opening, manipulating, and saving image files (in this case, the PNG file). GitHub Reference: Pillow GitHub Documentation: Pillow documentation numpy:  Description: A core Python library for numerical computing, used to manipulate the image data as arrays and ensure it is in a format suitable for the DICOM file. GitHub Reference: numpy GitHub Documentation: numpy documentation pydicom:  Description: A Python library for working with DICOM files. It allows reading, modifying, and saving DICOM datasets, including setting pixel data and metadata. GitHub Reference: pydicom GitHub Documentation: pydicom documentation Process: Load Existing DICOM: The pydicom library is used to read a pre-existing DICOM file. Load PNG Image: The Pillow library loads the PNG image to be used for replacing the image data in the DICOM file.                                                                  Process Image Data: If the PNG image is in grayscale mode (L), the pixel data is extracted and set as MONOCHROME1 (1-channel grayscale). If the PNG image is in RGBA mode, the pixel data is extracted and set as RGB (3-channel color). Update DICOM Metadata: The appropriate metadata for rows, columns, pixel data type, and bit depth is updated in the DICOM file based on the image mode. Save Updated DICOM: The modified DICOM file is saved with a new name reflecting the changes. Output: The code creates two output DICOM files: one with grayscale data (0015_result_bw.dcm) and one with RGB data (0015_result_rgb.dcm), depending on the image mode.",
                "https://github.com/pydicom/pydicom/issues/939"
            ],
            [
                "TIFF (.tif, .tiff)",
                "DICOM (.dcm)",
                "***This solution demonstrates how to convert a TIFF image into a DICOM file by extracting pixel data, adding relevant DICOM metadata, and saving it in the DICOM format.Tools Used: Pillow (PIL):  Description: A Python Imaging Library used to open and manipulate the input TIFF image. GitHub Reference: Pillow GitHub Documentation: Pillow documentation pydicom:  Description: A Python library for working with DICOM files. It is used to create a DICOM dataset, set metadata, and save the dataset as a DICOM file. GitHub Reference: pydicom GitHub Documentation: pydicom documentation numpy:  Description: A fundamental package for numerical computing in Python, used here to convert the image to an array for easier manipulation. GitHub Reference: numpy GitHub Documentation: numpy documentation Process: Load TIFF Image: The Pillow library is used to load the input TIFF image. Convert to numpy Array: The image is converted into a numpy array to facilitate manipulation and interaction with the pixel data. Create DICOM Dataset: A new DICOM dataset is created using pydicom. The pixel data from the image is added to the dataset, and essential metadata (such as patient information and modality) is included. Save DICOM File: The DICOM dataset is saved to a .dcm file using the pydicom library.  ***To convert TIFF images to DICOM format, MATLAB:  Using MATLAB: Tool: MATLAB Process: Utilize the dicomwrite function.",
                "https://stackoverflow.com/questions/30338697/convert-tiff-to-dicom-using-matlab"
            ],
            [
                "BMP (.bmp)",
                "DICOM (.dcm)",
                "This solution demonstrates how to convert a BMP image to a DICOM file using VTK and GDCM libraries, which handle image reading and writing operations.  Tools Used: VTK (Visualization Toolkit):  Description: A software system for 3D computer graphics, image processing, and visualization. The vtkBMPReader is used to read BMP files, and it also handles lookup tables if needed. GitHub Reference: VTK GitHub Documentation: VTK documentation GDCM (Grassroots DICOM):  Description: A library for handling DICOM files. In this solution, vtkGDCMImageWriter is used to write the image data into DICOM format. GitHub Reference: GDCM GitHub Documentation: GDCM documentation Process: Read BMP Image: The vtkBMPReader is used to load the input BMP image. Handle Lookup Tables (if present): If the BMP image uses a lookup table, the Allow8BitBMPOn() method ensures that the lookup table is appropriately applied to the image. Write DICOM File: The vtkGDCMImageWriter is used to write the image data into a DICOM format (.dcm file).",
                "https://stackoverflow.com/questions/5035078/convert-bmp-image-into-dicom"
            ],
            [
                "AVI (.avi)",
                "DICOM (.dcm)",
                "Tools Used fo-dicom Library Description: A .NET-based open-source library (available via NuGet as fo-dicom) for creating, reading, and writing DICOM files, capable of handling multi-frame data suitable for video-like sequences from AVI. OpenCV (Optional Integration) Description: A computer vision library (e.g., OpenCVSharp in .NET) for extracting individual frames from an AVI video file, often paired with fo-dicom for pixel data processing. DicomFile Class (fo-dicom) Description: A core class within fo-dicom for constructing and saving DICOM files, used to encapsulate AVI-derived frames and metadata. DicomDataset Class (fo-dicom) Description: Represents the DICOM dataset, allowing the addition of pixel data and metadata tags (e.g., Patient ID, Frame Rate) during conversion. Image Processing Libraries (e.g., System.Drawing or SixLabors.ImageSharp) Description: .NET libraries for converting AVI frames into a format (e.g., grayscale byte arrays) compatible with DICOM pixel data requirements. Steps of Conversion Load AVI File Description: Import the AVI video into the application using a library like OpenCV (e.g., VideoCapture in OpenCVSharp) to access its frame sequence. Extract Frames from AVI Description: Decompose the AVI video into individual frames, typically as bitmap or raw pixel data, using OpenCV or a similar tool, preparing them for DICOM multi-frame storage. Prepare Pixel Data Description: Convert the extracted frames into a format suitable for DICOM (e.g., 8-bit grayscale or RGB byte arrays), ensuring resolution (e.g., 512 × 512 pixels) and frame consistency, using an image processing library like SixLabors.ImageSharp. Create DicomDataset Instance Description: Initialize a new DicomDataset object via fo-dicom to serve as the container for the AVI frames and associated metadata. Add Pixel Data to DicomDataset Description: Embed the frame sequence as multi-frame pixel data into the DicomDataset using fo-dicom’s AddOrUpdate method, specifying the PixelData tag (e.g., DICOM Tag 7FE0,0010) and setting the NumberOfFrames tag to match the AVI frame count. Update DICOM Metadata Description: Populate the DicomDataset with mandatory and optional DICOM tags (e.g., PatientName, StudyDate, FrameTime) using fo-dicom’s tag management functions, ensuring compliance with DICOM standards like the Multi-Frame Grayscale Byte Secondary Capture Image Storage SOP Class. Generate and Save DICOM File Description: Wrap the DicomDataset in a DicomFile object and save it to disk (e.g., as \"output.dcm\") using fo-dicom’s Save or SaveAsync method, completing the conversion.",
                "https://github.com/fo-dicom/fo-dicom/issues/1007"
            ]
        ]
    },
    {
        "level": "5",
        "title": "Typical Resolution & Image Dimensions",
        "content-type": "markdown",
        "content": ""
    },
    {
        "level": "5.1",
        "title": "Spatial Resolution",
        "content-type": "markdown",
        "content": "256 × 256 pixels to 512 × 512 pixels, Reference: https://www.sciencedirect.com/science/article/pii/S1743181617302068?via%3Dihub"
    },
    {
        "level": "5.2",
        "title": "Voxel Size / Pixel Spacing",
        "content-type": "markdown",
        "content": "0.1 mm × 0.1 mm to 0.5 mm × 0.5 mm, Reference: https://www.sciencedirect.com/science/article/pii/S1743181617302068?via%3Dihub"
    },
    {
        "level": "5.3",
        "title": "Temporal Resolution (if applicable)",
        "content-type": "markdown",
        "content": "15–60 Hz, Reference: https://www.sciencedirect.com/science/article/pii/S1743181617302068?via%3Dihub"
    },
    {
        "level": "6",
        "title": "Data Size (Storage Requirements)",
        "content-type": "markdown",
        "content": ""
    },
    {
        "level": "6.1",
        "title": "Single Image Size",
        "content-type": "markdown",
        "content": "0.1 MB to 0.5 MB, Reference: https://www.wiley.com/en-au/PACS+and+Imaging+Informatics%3A+Basic+Principles+and+Applications%2C+2nd+Edition-p-9780470373729"
    },
    {
        "level": "6.2",
        "title": "Typical Study Size",
        "content-type": "markdown",
        "content": "50 MB to 500 MB, Reference: https://www.researchgate.net/publication/290091240_Digital_imaging_and_communications_in_medicine_DICOM_A_practical_introduction_and_survival_guide"
    },
    {
        "level": "7",
        "title": "Acquisition Device & Hardware Requirements",
        "content-type": "markdown",
        "content": ""
    },
    {
        "level": "7.1",
        "title": "Equipment Used",
        "content-type": "markdown",
        "content": "ultrasound machine, transducer, Additional components include a transmitter pulse generator, compensating amplifiers, a control unit for focusing, digital processors, and a display system, Reference: https://pubmed.ncbi.nlm.nih.gov/23408755/ , https://pubmed.ncbi.nlm.nih.gov/27429132/"
    },
    {
        "level": "7.2",
        "title": "Typical Manufacturers",
        "content-type": "markdown",
        "content": "GE Healthcare, Philips Healthcare, Siemens Healthineers, Canon Medical Systems, Samsung Medison, Mindray, Fujifilm VisualSonics, Hitachi-Aloka Medical, Esaote"
    },
    {
        "level": "8",
        "title": "Common Clinical Applications",
        "content-type": "markdown",
        "content": ""
    },
    {
        "level": "8.1",
        "title": "Primary Uses",
        "content-type": "markdown",
        "content": "Fetal monitoring and pregnancy assessment, Abdominal imaging, Cardiac imaging (echocardiography), Musculoskeletal imaging, Tumor detection, Guidance for procedures, Reference: https://pmc.ncbi.nlm.nih.gov/articles/PMC7458857/ , https://pubmed.ncbi.nlm.nih.gov/27429132/"
    },
    {
        "level": "8.2",
        "title": "Specialized Uses",
        "content-type": "markdown",
        "content": "Preoperative tumor staging, Vascular imaging support, Elastography integration, Small parts imaging, Point-of-care ultrasound (POCUS), Ophthalmic imaging, Reference: https://pubmed.ncbi.nlm.nih.gov/27429132/ , https://pmc.ncbi.nlm.nih.gov/articles/PMC3564184/"
    },
    {
        "level": "9",
        "title": "Radiation & Safety Considerations",
        "content-type": "markdown",
        "content": ""
    },
    {
        "level": "9.1",
        "title": "Ionizing Radiation",
        "content-type": "markdown",
        "content": "No, Reference: https://pubmed.ncbi.nlm.nih.gov/28524933/"
    },
    {
        "level": "9.2",
        "title": "Radiation Dose (if applicable)",
        "content-type": "markdown",
        "content": "None"
    },
    {
        "level": "9.3",
        "title": "Safety Concerns",
        "content-type": "markdown",
        "content": "Minimal (thermal effects, cavitation risk at high levels, caution in pregnancy), No contraindications, Reference: https://pubmed.ncbi.nlm.nih.gov/39526313/"
    },
    {
        "level": "10",
        "title": "Preprocessing & Data Preparation",
        "content-type": "markdown",
        "content": ""
    },
    {
        "level": "10.1",
        "title": "Common Preprocessing Steps",
        "content-type": "markdown",
        "content": ""
    },
    {
        "level": "10.2",
        "title": "Compression Methods (if any)",
        "content-type": "markdown",
        "content": "Envelope detection, log compression, noise reduction (e.g., speckle filtering), Time-Gain Compensation (TGC), interpolation, DICOM conversion, Reference: https://colab.ws/articles/10.1109%2F31.16577 , https://www.researchgate.net/publication/272007947_Speckle_reduction_techniques_in_medical_ultrasound_imaging , https://pubmed.ncbi.nlm.nih.gov/7403261/"
    },
    {
        "level": "11",
        "title": "Challenges & Limitations",
        "content-type": "markdown",
        "content": "Lossless (e.g., JPEG2000, RLE), Lossy (e.g., JPEG, JPEG2000) in some cases, proprietary formats, Reference: https://pubmed.ncbi.nlm.nih.gov/18218529/ , https://pmc.ncbi.nlm.nih.gov/articles/PMC10610864/"
    },
    {
        "level": "11.1",
        "title": "Technical Challenges",
        "content-type": "markdown",
        "content": "speckle noise, attenuation/depth trade-off, shadowing artifacts, reverberation, operator dependence, limited field of view, Reference: https://pubmed.ncbi.nlm.nih.gov/16790922/"
    },
    {
        "level": "11.2",
        "title": "Clinical Limitations",
        "content-type": "markdown",
        "content": "poor gas/bone imaging, limited resolution for small structures, obesity challenges, operator variability, low specificity, obstructed views, Reference: https://www.researchgate.net/publication/225095678_Diagnostic_Ultrasound_Physics_and_Equipment , https://pubmed.ncbi.nlm.nih.gov/31736130/"
    },
    {
        "level": "prepration-meta-data-prepared_by",
        "title": "prepared_by",
        "content-type": "rawtext",
        "content": "Negin Fathi Hafshejani"
    },
    {
        "level": "prepration-meta-data-confirmed_by",
        "title": "confirmed_by",
        "content-type": "rawtext",
        "content": ""
    },
    {
        "level": "prepration-meta-data-date_of_preparation",
        "title": "date_of_preparation",
        "content-type": "rawtext",
        "content": "2025-03-18"
    },
    {
        "level": "prepration-meta-data-planned_next_review",
        "title": "planned_next_review",
        "content-type": "rawtext",
        "content": ""
    },
    {
        "level": "prepration-meta-data-requires_completion",
        "title": "requires_completion",
        "content-type": "rawtext",
        "content": ""
    }
]